#include <iostream>
#include "Adres.h"
#include "windows.h"

using namespace std;

int main()
{
    system("chcp 1251");
    system("cls");
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    cout << endl << "----------------" << "Размещение объектов в статической памяти" << "----------------" << endl << endl;
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    {
        Adres a("Иванов Иван Иванович", "Хабаровск", "ул. Ленина", 13);
        Adres b = a;
    }
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    cout << endl << "----------------" << "Размещение объектов в динамической памяти" << "----------------" << endl << endl;
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    Adres *c = new Adres;
    c->set("Петров Пётр Петрович", "Москва", "ул. Пушкина", 42);
    c->show();
    delete c;
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    cout << endl << "----------------" << "Размещение объектов в статическом массиве" << "----------------" << endl << endl;
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    {
        Adres d[2] = {Adres("Иванов Иван Иванович", "Хабаровск", "ул. Ленина", 13), Adres("Петров Пётр Петрович", "Москва", "ул. Пушкина", 42)};
    }
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    cout << endl << "----------------" << "Размещение объектов в динамическом массиве" << "----------------" << endl << endl;
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    {
        Adres *e = new Adres[2];
        e[0].set("Иванов Иван Иванович", "Хабаровск", "ул. Ленина", 13);
        e[0].show();
        e[1].set("Петров Пётр Петрович", "Москва", "ул. Пушкина", 42);
        e[1].show();
        delete [] e;
    }
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    cout << endl << "----------------" << "Установка и получение полей данных" << "----------------" << endl << endl;
    /*-----------------------------------------------------------------------------------------------------------------------------*/
    Adres f;
    char name[100];
    char city[100];
    char street[100];
    int number;
    cout << "Введите ФИО: ";
    cin.getline(name, 100);
    cout << "Введите населённый пункт: ";
    cin.getline(city, 100);
    cout << "Введите улицу: ";
    cin.getline(street, 100);
    cout << "Введите номер дома: ";
    cin >> number;
    f.setName(name);
    f.setCity(city);
    f.setStreet(street);
    f.setNumber(number);
    cout << "ФИО: " << f.getName() << endl;
    cout << "Населённый пункт: " << f.getCity() << endl;
    cout << "Улица: " << f.getStreet() << endl;
    cout << "Номер дома: " << f.getNumber() << endl;
    f.whoLivesHere();
    return 0;
}
